comment_test/tsung_logs/20210305-2147/tsung_example.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="Boning.eba-2ztxhtsv.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
    </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>
    <option name="file_server" id="userlist" value=".tsung/userlist.csv"/>
  </options>

  <sessions>
    
    <session name="comment_test" type="ts_http" weight="1">

      <request><http method="GET" url="/"/></request>

      <setdynvars sourcetype="file" fileid="userlist" delimiter=";" order="random">
        <var name="user_name"/>
        <var name="user_email"/>
        <var name="user_password"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="5">
        <var name="game_id"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="1000">
        <var name="group_id"/>
      </setdynvars>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                             {ok,Val}=ts_dynvars:lookup(user_email,DynVars),                             http_uri:encode(Val) end.">
        <var name="encoded_user_email"/>
      </setdynvars>
     
      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                             {ok,Val}=ts_dynvars:lookup(user_email,DynVars),                             http_uri:encode(Val) end.">
        <var name="encoded_user_email"/>
      </setdynvars>
      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->                             {ok,Val}=ts_dynvars:lookup(user_password,DynVars),                             http_uri:encode(Val) end.">
        <var name="encoded_user_password"/>
      </setdynvars>

      <thinktime random="true" min="2" max="5"/>

      <request subst="true">
        <http url="/users/sign_in" version="1.1" contents="authenticity_token=null&amp;user%5Bemail%5D=%%_encoded_user_email%%&amp;user%5Bpassword%5D=%%_encoded_user_password%%&amp;user%5Bremember_me%5D=0&amp;commit=Log+in" content_type="application/x-www-form-urlencoded" method="POST">
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
        </http>
      </request>

      <request subst="true"><http method="GET" url="/games/%%_game_id%%/groups"/></request>
      <request subst="true"><http method="GET" url="/games/1/groups/%%_group_id%%"/></request>

      <request subst="true">
          <http url="/games/1/groups/%%_group_id%%/comments" version="1.1" contents="authenticity_token=null&amp;comment%5Bbody%5D=test&amp;commit=Save+Comment" content_type="application/x-www-form-urlencoded" method="POST">
            <http_header name="Accept-Encoding" value="gzip, deflate"/>
          </http>
      </request>

      <thinktime random="true" min="2" max="5"/>

      <request subst="true"><http method="GET" url="/profile/%%_user_name%%"/></request>

      <request subst="true">
          <http url="/profile/%%_user_name%%/comments" version="1.1" contents="authenticity_token=null&amp;comment%5Bbody%5D=test&amp;commit=Save+Comment" content_type="application/x-www-form-urlencoded" method="POST">
            <http_header name="Accept-Encoding" value="gzip, deflate"/>
          </http>
      </request>

      <request subst="true">
      <http url="/users/sign_out" version="1.1" contents="_method=delete&amp;authenticity_token=null&amp;" content_type="application/x-www-form-urlencoded" method="POST">
        <http_header name="Accept-Encoding" value="gzip, deflate"/>
      </http>
    </request>
    </session>
  </sessions>
</tsung>